## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

- Sucessfully, Installed : 최초 설치
- Requirement already satisfied... : 이미 설치

In [10]:
# 판다스 라이브러리 로딩
import pandas as pd

### Pandas 기본
#### DataFrame 객체
-파이썬 2차원 리스트(배열)과 동일
- 행(row) 각 하나의 유니크 데이터묶음
- 열(column) 유니크 데이터의 하나하나의 특성

In [11]:
## 딕셔너리로 DataFrame 객체 생성 = 일반 2차원 리스트와 동일하게 생성 가능
data = {'이름':['홍길동','전요한','Sam'],'나이':[29,40,41],'결혼 여부':['True','False','True']}
df = pd.DataFrame(data)
df

    이름  나이  결혼 여부
0  홍길동  29   True
1  전요한  40  False
2  Sam  41   True

In [12]:
# 2차원 리스트 생성
data = [['홍길동',29,'대한민국','Hgd@nate.com',True],['전요한',40,'수리남','Gby@google.com',False],
        ['Sam',41,'영국','sam7138@google.com',True],['홍길순',18,'대한민국','hgs@daum.net',False]]

data

[['홍길동', 29, '대한민국', 'Hgd@nate.com', True],
 ['전요한', 40, '수리남', 'Gby@google.com', False],
 ['Sam', 41, '영국', 'sam7138@google.com', True],
 ['홍길순', 18, '대한민국', 'hgs@daum.net', False]]

In [13]:
# 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data,columns=['이름','나이','국적','이메일','결혼 여부'])
df

    이름  나이    국적                 이메일  결혼 여부
0  홍길동  29  대한민국        Hgd@nate.com   True
1  전요한  40   수리남      Gby@google.com  False
2  Sam  41    영국  sam7138@google.com   True
3  홍길순  18  대한민국        hgs@daum.net  False

In [14]:
## DataFrame에서 데이터 조회(열) - 리스트는 for문을 써야지 출력가능
df['이름']

0    홍길동
1    전요한
2    Sam
3    홍길순
Name: 이름, dtype: object

In [15]:
## DataFrame에서 조회(두개의 열 조회)
df[['이름','나이']]

    이름  나이
0  홍길동  29
1  전요한  40
2  Sam  41
3  홍길순  18

In [16]:
## DataFrame 행으로 조회
df.loc[0]

이름                홍길동
나이                 29
국적               대한민국
이메일      Hgd@nate.com
결혼 여부            True
Name: 0, dtype: object

In [17]:
## DataFrame에서 조회(행)
df.loc[[0,2]]

    이름  나이    국적                 이메일  결혼 여부
0  홍길동  29  대한민국        Hgd@nate.com   True
2  Sam  41    영국  sam7138@google.com   True

In [18]:
# 현재 DataFrame 확인 
df

    이름  나이    국적                 이메일  결혼 여부
0  홍길동  29  대한민국        Hgd@nate.com   True
1  전요한  40   수리남      Gby@google.com  False
2  Sam  41    영국  sam7138@google.com   True
3  홍길순  18  대한민국        hgs@daum.net  False

In [19]:
# 새 컬럼 추카
df['전화 번호'] = ['010','02','070','018']

In [20]:
# 추가된 DataFrame 확인
df

    이름  나이    국적                 이메일  결혼 여부 전화 번호
0  홍길동  29  대한민국        Hgd@nate.com   True   010
1  전요한  40   수리남      Gby@google.com  False    02
2  Sam  41    영국  sam7138@google.com   True   070
3  홍길순  18  대한민국        hgs@daum.net  False   018

In [21]:
# 열 삭제 , axis = 0(행),1(열)
df.drop('결혼 여부',axis=1)

    이름  나이    국적                 이메일 전화 번호
0  홍길동  29  대한민국        Hgd@nate.com   010
1  전요한  40   수리남      Gby@google.com    02
2  Sam  41    영국  sam7138@google.com   070
3  홍길순  18  대한민국        hgs@daum.net   018

In [22]:
## drop()은 삭제하고 출력만 해준다. 완전한 삭제를 위해서는 inplace 옵션을 사용해야 한다.
# inplace를 사용하면 화면에 출력이 안된다
df.drop('결혼 여부',axis=1,inplace=True)

In [23]:
# 삭제를 확인
df

    이름  나이    국적                 이메일 전화 번호
0  홍길동  29  대한민국        Hgd@nate.com   010
1  전요한  40   수리남      Gby@google.com    02
2  Sam  41    영국  sam7138@google.com   070
3  홍길순  18  대한민국        hgs@daum.net   018

In [24]:
df.loc[4] = ['선영',17,'대한민국','yong@gmail.com','010']

In [25]:
df

    이름  나이    국적                 이메일 전화 번호
0  홍길동  29  대한민국        Hgd@nate.com   010
1  전요한  40   수리남      Gby@google.com    02
2  Sam  41    영국  sam7138@google.com   070
3  홍길순  18  대한민국        hgs@daum.net   018
4   선영  17  대한민국      yong@gmail.com   010

In [26]:
# 행 삭제
df2 = df.drop(4)

In [27]:
df2

    이름  나이    국적                 이메일 전화 번호
0  홍길동  29  대한민국        Hgd@nate.com   010
1  전요한  40   수리남      Gby@google.com    02
2  Sam  41    영국  sam7138@google.com   070
3  홍길순  18  대한민국        hgs@daum.net   018

In [28]:
#행 삭제 inplace
df.drop(2,inplace=True,axis=0)

In [29]:
df

    이름  나이    국적             이메일 전화 번호
0  홍길동  29  대한민국    Hgd@nate.com   010
1  전요한  40   수리남  Gby@google.com    02
3  홍길순  18  대한민국    hgs@daum.net   018
4   선영  17  대한민국  yong@gmail.com   010

In [30]:
# 열 이름 변경
df.rename(columns={'전화 번호':'휴대폰'}, inplace=True)

In [31]:
df

    이름  나이    국적             이메일  휴대폰
0  홍길동  29  대한민국    Hgd@nate.com  010
1  전요한  40   수리남  Gby@google.com   02
3  홍길순  18  대한민국    hgs@daum.net  018
4   선영  17  대한민국  yong@gmail.com  010

- DataFrame은 파이썬의 2차원 리스트와 동일하지만 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서의 1차원 리스트(배열)
- 시리즈를 그루핑한게 DataFrame
- 가장 최소 단위

In [32]:
data = [47,20,40,18,17]

srs = pd.Series(data)
srs

0    47
1    20
2    40
3    18
4    17
dtype: int64

In [38]:
# DataFrame의 한 열을 가지고온 자료구조와 시리즈는 동일
type(df['나이'])

pandas.core.series.Series

In [34]:
type(srs)

pandas.core.series.Series

In [43]:
srs = pd.Series(data= data,index=['홍길동','전요한','홍길순','선영은','강정택'])
srs

홍길동    47
전요한    20
홍길순    40
선영은    18
강정택    17
dtype: int64